configuration/config/iplm/testresources/claimretrieve/RetrieveClaimRq-SAMPLE-SOAP.xml

<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"></SOAP-ENV:Header>
  <soap:Body>
    <wb:RetrieveClaimRq
      Sender="insurer"
      Receiver="serviceprovider"
      xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1"
      xmlns:wb="http://www.xchanging.com/retrieveClaim/rq/1"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xsi:schemaLocation="http://www.xchanging.com/retrieveClaim/rq/1 RetrieveClaimRq.xsd">
      <UUId>20111803-7778-5558-bbbb-1aa00005b415</UUId>
      <InsurerReference>InsurerReference</InsurerReference>
      <CreationDate>2006-06-22T15:16:30+01:00</CreationDate>
      <Insurer>
        <Party>
          <Id
            Agency="lloyds">urn:lloyds:0623
          </Id>
          <Name>Beazley 0623</Name>
        </Party>
      </Insurer>
      <ServiceProvider>
        <Party>
          <Id
            Agency="DUNS_dun_and_bradstreet">urn:duns:236196817
          </Id>
          <Name>Xchanging</Name>
        </Party>
      </ServiceProvider>
      <wb:ReferredObjects>
        <wb:Contract>
          <BrokerReference>B0001UMR</BrokerReference>
        </wb:Contract>
        <wb:Claim>
          <BrokerReference>B0001UCR</BrokerReference>
          <wb:ClaimLineNumber>1</wb:ClaimLineNumber>
          <wb:ClaimType>001</wb:ClaimType>
        </wb:Claim>
        <wb:ClaimEntry>
          <BrokerReference>B0001TR</BrokerReference>
        </wb:ClaimEntry>
      </wb:ReferredObjects>
    </wb:RetrieveClaimRq>
  </soap:Body>
</soap:Envelope>